Show / Hide Table of Contents
Class ReflectionHelper
Helper for reflection methods used by gRPC.
Inheritance
System.Object
ReflectionHelper
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Utilities
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public static class ReflectionHelper
Methods
Improve this Doc   View Source
GetLoadedType(String)
Declaration
public static Type GetLoadedType(string fullName)
Parameters
 Type |  Name |  Description
 System.String |  fullName
Returns
 Type |  Description
 System.Type
Improve this Doc   View Source
GetMethodInvokeArguments(Object[])
Gets a gRPC message for invoking method.
Declaration
public static IEnumerable<GrpcReflectionArgument> GetMethodInvokeArguments(params object[] args)
Parameters
 Type |  Name |  Description
 System.Object[] |  args
Returns
 Type |  Description
 System.Collections.Generic.IEnumerable<GrpcReflectionArgument>
Improve this Doc   View Source
InvokeMethodFromGrpc(Object, String, IEnumerable<GrpcReflectionArgument>)
Invokes method based on parameters passed from grpc message.
Declaration
public static Task<object> InvokeMethodFromGrpc(object instance, string methodName, IEnumerable<GrpcReflectionArgument> arguments)
Parameters
 Type |  Name |  Description
 System.Object |  instance
 System.String |  methodName
 System.Collections.Generic.IEnumerable<GrpcReflectionArgument> |  arguments
Returns
 Type |  Description
 System.Threading.Tasks.Task<System.Object>
Improve this Doc   View Source
IsSimpleType(Type)
Determine whether the target type is simple type.
Declaration
public static bool IsSimpleType(Type type)
Parameters
 Type |  Name |  Description
 System.Type |  type
Type to check
Returns
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source